Revit 2026 API

# AdvancedTransparentTransparentIor Property

---

The property labeled "IOR" from the "AdvancedTransparent" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TransparentIor { get; }
```
```vb
Public Shared ReadOnly Property TransparentIor As String
	Get
```
```cpp
public:
static property String^ TransparentIor {
	String^ get ();
}
```
```fsharp
static member TransparentIor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

AdvancedTransparent Class

Autodesk.Revit.DB.Visual Namespace